<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Microsoft OneDrive installer and imports into Munki.</string>
    <key>Identifier</key>
    <string>supportplan.com.munki.microsoftonedrive</string>
    <key>ParentRecipe</key>
    <string>supportplan.com.pkg.microsoftonedrive</string>
	<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>version</key>
						<string>%version%</string>
					</dict>
				</dict>
			</dict>
		</array>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MicrosoftOnedrive</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Microsoft</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Microsoft Onedrive</string>
            <key>display_name</key>
            <string>Microsoft Onedrive</string>
            <key>developer</key>
            <string>Microsoft</string>
            <key>category</key>
            <string>Productivity</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>minimum_os_version</key>
            <string>10.14.0</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash

				USERS=$(dscacheutil -q user | grep -A 3 -B 2 -e uid:\ 5'[0-9][0-9]' | grep "name" | cut -c7-)


				for USER in $USERS; do
					who | awk '{print $1}' | sort | uniq | grep -q "^$USER\$" &amp;&amp; {
						open -a /Applications/OneDrive.app
						sleep 10
						profiledir="$(dscacheutil -q user -a name $USER | grep -A 3 -B 2 -e uid:\ 5'[0-9][0-9]' | grep "dir" | cut -c6-)"
						defaults write $profiledir/Library/Preferences/com.microsoft.OneDriveUpdater.plist Tier -string "Deferred"
						defaults write $profiledir/Library/Preferences/com.microsoft.OneDrive.plist DisableAutoUpdate true
						defaults write $profiledir/Library/Preferences/com.microsoft.OneDrive.plist Tier -string "Deferred"
					} || {
						:
					}
				done</string>
				<key>preinstall_script</key>
				<string>#!/bin/bash

				USERS=$(dscacheutil -q user | grep -A 3 -B 2 -e uid:\ 5'[0-9][0-9]' | grep "name" | cut -c7-)

				for USER in $USERS; do
					who | awk '{print $1}' | sort | uniq | grep -q "^$USER\$" &amp;&amp; {
						echo "$USER is logged in"
						killall OneDrive || :
						exit 0
					} || {
						echo "$USER is not logged in"
					}
				done
				exit 1</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
	<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
				<key>Arguments</key>
				<dict>
					<key>additional_pkginfo</key>
					<dict>
						<key>version</key>
						<string>%version%</string>
					</dict>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkg_path</key>
					<string>%pkg_path%</string>
					<key>repo_subdirectory</key>
					<string>%MUNKI_REPO_SUBDIR%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiImporter</string>
			</dict>
		</array>
</dict>
</plist>