<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of NTFS for Mac and extracts the app information.

Set the DERIVE_MIN_OS variable to a non-empty string to set the minimum_os_version via MunkiInstallsItemsCreator. This requires a minimum AutoPkg version of 2.7 please update if you're not already running it.</string>
	<key>Identifier</key>
	<string>supportplan.com.pkg.NTFSforMac</string>
	<key>Input</key>
	<dict>
		<key>DERIVE_MIN_OS</key>
		<string>YES</string>
		<key>NAME</key>
		<string>NTFS for Mac</string>
		<key>VENDOR</key>
		<string>Paragon</string>
        <key>SOFTWARETITLE</key>
        <string>NTFS for Mac</string>
        <key>VERSIONTYPE</key>
        <string>CFBundleShortVersionString</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.7</string>
	<key>ParentRecipe</key>
	<string>supportplan.com.download.NTFSforMac</string>
	<key>Process</key>
	        <array>
	            <dict>
	                <key>Processor</key>
	                <string>FlatPkgUnpacker</string>
	                <key>Arguments</key>
	                <dict>
	                    <key>flat_pkg_path</key>
	                    <string>%pathname%/FSInstaller.app/Contents/Resources/product.pkg</string>
	                    <key>destination_path</key>
	                    <string>%RECIPE_CACHE_DIR%/unpack</string>
	                </dict>
	            </dict>
	            <dict>
	                <key>Processor</key>
	                <string>PkgPayloadUnpacker</string>
	                <key>Arguments</key>
	                <dict>
	                    <key>pkg_payload_path</key>
	                    <string>%RECIPE_CACHE_DIR%/unpack/%SOFTWARETITLE%.pkg/Payload</string>
	                    <key>destination_path</key>
	                    <string>%RECIPE_CACHE_DIR%/payload</string>
	                </dict>
	            </dict>
	            <dict>
	                <key>Processor</key>
	                <string>Versioner</string>
	                <key>Arguments</key>
	                <dict>
	                    <key>input_plist_path</key>
	                    <string>%RECIPE_CACHE_DIR%/payload/%SOFTWARETITLE%.app/Contents/Info.plist</string>
	                    <key>plist_version_key</key>
	                    <string>%VERSIONTYPE%</string>
	                </dict>
	            </dict>
	            <dict>
	                <key>Processor</key>
	                <string>PkgCopier</string>
	                <key>Arguments</key>
	                <dict>
	                    <key>source_pkg</key>
	                    <string>%pathname%</string>
	                    <key>pkg_path</key>
	                    <string>%RECIPE_CACHE_DIR%/%VENDOR%_%SOFTWARETITLE%_%version%.pkg</string>
	                </dict>
	            </dict>
	            <dict>
	                <key>Arguments</key>
	                <dict>
	                    <key>path_list</key>
	                    <array>
	                        <string>%RECIPE_CACHE_DIR%/unpack</string>
	                        <string>%RECIPE_CACHE_DIR%/payload</string>
	                    </array>
	                </dict>
	                <key>Processor</key>
	                <string>PathDeleter</string>
	            </dict>
	        </array>
	    </dict>
	</plist>