<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of NTFS for Mac and creates a package.</string>
	<key>Identifier</key>
	<string>supportplan.com.pkg.NTFSforMac</string>
	<key>Input</key>
	<dict>
		<key>DERIVE_MIN_OS</key>
		<string>YES</string>
		<key>NAME</key>
		<string>NTFS for Mac</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>supportplan.com.download.NTFSforMac</string>
	<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>flat_pkg_path</key>
					<string>%pathname%/FSInstaller.app/Contents/Resources/product.pkg</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack</string>
				</dict>
				<key>Processor</key>
				<string>FlatPkgUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/payload/root/Applications</string>
					<key>pkgdirs</key>
					<dict/>
				</dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
			</dict>
			<dict>
				<key>Comment</key>
				<string>NTFS for Mac installs in /Applications/NTFS for Mac.app so extract accordingly</string>
				<key>Arguments</key>
				<dict>
					<key>pkg_payload_path</key>
					<string>%RECIPE_CACHE_DIR%/unpack/Payload</string>
					<key>destination_path</key>
					<string>%RECIPE_CACHE_DIR%/payload/root/Applications</string>
				</dict>
				<key>Processor</key>
				<string>PBXZPayloadUnpacker</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>faux_root</key>
					<string>%RECIPE_CACHE_DIR%/payload/root</string>
					<key>installs_item_paths</key>
					<array>
						<string>/Applications/NTFS for Mac.app</string>
					</array>
					<key>derive_minimum_os_version</key>
					<string>%DERIVE_MIN_OS%</string>
				</dict>
				<key>Processor</key>
				<string>MunkiInstallsItemsCreator</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict/>
				<key>Processor</key>
				<string>MunkiPkginfoMerger</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>info_path</key>
					<string>%RECIPE_CACHE_DIR%/payload/root/Applications/NTFS for Mac.app</string>
				</dict>
				<key>Processor</key>
				<string>PlistReader</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>path_list</key>
					<array>
						<string>%RECIPE_CACHE_DIR%/unpack</string>
						<string>%RECIPE_CACHE_DIR%/payload</string>
					</array>
				</dict>
				<key>Processor</key>
				<string>PathDeleter</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>source_pkg</key>
					<string>%pathname%/FSInstaller.app/Contents/Resources/product.pkg</string>
					<key>pkg_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				</dict>
				<key>Processor</key>
				<string>PkgCopier</string>
			</dict>
		</array>
	</dict>
</plist>
