<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.2.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of NTFS for Mac.</string>
	<key>Identifier</key>
	<string>supportplan.com.download.NTFSforMac</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>NTFS for Mac</string>
		<key>DOWNLOAD_URL</key>
		<string>https://www.seagate.com/content/dam/seagate/migrated-assets/www-content/support-content/external-products/backup-plus/_shared/downloads/NTFS_Paragon_Driver.dmg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>URLDownloader</string>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%DOWNLOAD_URL%</string>
				</dict>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/FSInstaller.app/Contents/Resources/product.pkg</string>
					<key>expected_authority_names</key>
					<array>
						<string>Developer ID Installer: Paragon Software GmbH (LSJ6YVK468)</string>
						<string>Developer ID Certification Authority</string>
						<string>Apple Root CA</string>
					</array>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
	