<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.munki.MAS-iMovie</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>iLife_iMovie</string>
		<key>PATH</key>
		<string>/Applications/iMovie.app</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>iLife</string>
			<key>description</key>
			<string>Make beautiful HD movies anywhere.</string>
			<key>developer</key>
			<string>Apple</string>
			<key>display_name</key>
			<string>iMovie</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>supportplan.munki.iMovie</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.nmcspadden.munki.appstore</key>
			<dict>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.nmcspadden-recipes/AppStoreApp/AppStoreApp.munki.recipe</string>
				<key>sha256_hash</key>
				<string>1f0e83ad8f82ac23d4cba7d212c1b3a9c75e1cf18082a89109965b2d0d259235</string>
			</dict>
			<key>supportplan.munki.iMovie</key>
			<dict>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.SupportPlan.AutoPKGRecipes/iMovie/MAS-iMovie.munki.recipe</string>
				<key>sha256_hash</key>
				<string>be3c4e560c67710dfaba78c0516e25fa21ee0a87f15dc0546cf65ac0548c59d9</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
