<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.3.1 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Install Spotify and imports it into Munki.</string>
	<key>Identifier</key>
	<string>supportplan.com.munki.InstallSpotify</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>Install Spotify</string>
		<key>pkginfo</key>
		<dict>
			<key>installs</key>
				<array>
					<dict>
						<key>CFBundleIdentifier</key>
						<string>com.spotify.client</string>
						<key>CFBundleName</key>
						<string>Spotify</string>
						<key>CFBundleShortVersionString</key>
						<string>1.2.30.1135.g02fef27a</string>
						<key>CFBundleVersion</key>
						<string>1.2.30.1135.g02fef27a-399</string>
						<key>minosversion</key>
						<string>10.11</string>
						<key>path</key>
						<string>/Applications/Spotify.app</string>
						<key>type</key>
						<string>application</string>
						<key>version_comparison_key</key>
						<string>CFBundleShortVersionString</string>
					</dict>
				</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Stream music, create playlists and more.</string>
			<key>developer</key>
			<string>Spotify</string>
			<key>display_name</key>
			<string>Spotify</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>postinstall_script</key>
			<string>#!/bin/zsh
				open -a /Applications/Install\ Spotify.app
				sleep 5
				installing=$(fuser -fu /Applications/Install\ Spotify.app/Contents/MacOS/Install\ Spotify)
				while [ $installing ]; do
				sleep 1
				installing=$(fuser -fu /Applications/Install\ Spotify.app/Contents/MacOS/Install\ Spotify)
				done
				if [ -d /Applications/Spotify.app ]; then
				spotify_pid=$(fuser -fu /Applications/Spotify.app/Contents/MacOS/Spotify)
				kill $spotify_pid
				else
				spotify_pid=$(fuser -f "/Users/*/Applications/Spotify.app/Contents/MacOS/Spotify") || :
				kill $spotify_pid || :
				mv /Users/*/Applications/Spotify.app /Applications/Spotify.app
				fi
				rm -rf /Applications/Install\ Spotify.app
				/bin/chmod -R go+rX /Applications/Spotify.app
			</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>ParentRecipe</key>
	<string>supportplan.com.download.InstallSpotify</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
				<key>dmg_root</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>DmgCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%dmg_path%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
