<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Creates a package installer out of a MAS app if a newer version is available locally.</string>
    <key>Identifier</key>
    <string>supportplan.pkg.wrappedappstore</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AppStoreApp</string>
        <key>PATH</key>
        <string>/Applications/%NAME%.app</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%PATH%/Wrapper/%NAME%.app/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>AppPkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>app_path</key>
                <string>%PATH%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>